InformationRegisters/ТарифныеСтавкиПервогоРазрядаОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>ТарифныеСтавкиПервогоРазрядаОрганизаций</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТарифнаяСтавка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеСтавкиПервогоРазряда</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыПараметровДляРасчетаЗарплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>ВидыПараметровДляРасчетаЗарплаты</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БазоваяВеличина</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БазоваяСтавка1разряда</Name>
					<Comment>Ставка первого разряда по РБ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БПМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МинимальнаяЗарплатаРБ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧасоваяМинимальнаяЗарплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СредняяЗП</Name>
					<Comment>Средняя зарплата рабочих и служащих </Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СредняяЗПРаботников</Name>
					<Comment>Средняя зарплата работников (для ограничения отчислений с ФОТ и БЛ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СреднемесячнаяНормаДней</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СреднемесячнаяНормаЧасов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СреднемесячноеКалендДней</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоэффициентДляРасчетаОтпуска</Name>
					<Comment>Среднемесячное количество календарных дней в месяце для расчета отпуска</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ставка1разрядаОрганизации</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыТарифныхСтавок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>ВидыТарифныхСтавок</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Месячная</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Дневная</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Часовая</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/ШтатноеРасписаниеОрганизаций/Ext/Module.bsl
//Функция рассчитывает оклад / ЧТС
//на текущую дату
Функция РассчитатьТариф(Организация, ДатаВступленияВСилу, ТекущиеДанные) Экспорт
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.Должность) Тогда
		Возврат 0;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.ТарифнаяСтавкаПервогоРазряда) Тогда
		Возврат 0;
	КонецЕсли;
	
	Если Не ТекущиеДанные.Должность.СтрокаЕТС.КратныеКоэффициенты Тогда
		Если Не ЗначениеЗаполнено(ТекущиеДанные.РазрядЕТС) Тогда
			Возврат 0;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.КоэффициентЕТС) Тогда
		Возврат "";
	КонецЕсли;
	
	ПараметрыНормыЧасов = РегистрыСведений.РазмерыПараметровДляРасчета.ПолучитьПоследнее(ДатаВступленияВСилу,
		Новый Структура("ВидПараметра", Перечисления.ВидыПараметровДляРасчетаЗарплаты.СреднемесячнаяНормаЧасов));
		
	СреднееКоличествоЧасов = ПараметрыНормыЧасов.Размер;
	
	РазмерСтавки1Разряда = 0; 
	Тариф = 0;
	РазмерСтавки1Разряда = ПолучитьРазмерТарифнойСтавки(Организация, ДатаВступленияВСилу, ТекущиеДанные.ТарифнаяСтавкаПервогоРазряда);
	
	Если РазмерСтавки1Разряда <> 0 Тогда
		
		ПовышенныйКоэффициентЕТС = ТекущиеДанные.ПовышенныйКоэффициентЕТС;
		КоэффициентыПоЕТС = ТекущиеДанные.Должность.КоэффициентыПоЕТС;
		
		Для Каждого СтрокаКоэффициентыПоЕТС Из КоэффициентыПоЕТС Цикл
			ПовышенныйКоэффициентЕТС = ПовышенныйКоэффициентЕТС * СтрокаКоэффициентыПоЕТС.Размер;
		КонецЦикла;                       
		
		Если ТекущиеДанные.Должность.ВидТарифнойСтавки = Перечисления.ВидыТарифныхСтавок.Месячная Тогда
			
			Тариф = Окр(РазмерСтавки1Разряда * ТекущиеДанные.КоэффициентЕТС * ПовышенныйКоэффициентЕТС);
			
		Иначе
			
			Если СреднееКоличествоЧасов = 0 Тогда
				Возврат 0;
			КонецЕсли;
			
			Тариф = Окр((РазмерСтавки1Разряда * ТекущиеДанные.КоэффициентЕТС * ПовышенныйКоэффициентЕТС) / СреднееКоличествоЧасов , 0);
			
		КонецЕсли;
		
	Иначе 
		
		Возврат 0;
		
	КонецЕсли;
	
	Возврат Тариф;
КонецФункции

//Функция возвращает размер ТС 1-го разряда организации
//на текущую дату
Функция ПолучитьРазмерТарифнойСтавки(Организация, ДатаВступленияВСилу, ТарифнаяСтавка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", 	Организация);
	Запрос.УстановитьПараметр("Период", 		ДатаВступленияВСилу);
	Запрос.УстановитьПараметр("ТарифнаяСтавка", ТарифнаяСтавка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТарифныеСтавкиПервогоРазрядаОрганизацийСрезПоследних.Размер
	|ИЗ
	|	РегистрСведений.ТарифныеСтавкиПервогоРазрядаОрганизаций.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И ТарифнаяСтавка = &ТарифнаяСтавка) КАК ТарифныеСтавкиПервогоРазрядаОрганизацийСрезПоследних";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() тогда
		Возврат Выборка.Размер;
	КонецЕсли;
	
КонецФункции
